---
kind: method
id: M:Autodesk.Revit.DB.Family.GetFamilySymbolIds
zh: 族
source: html/8989a269-c516-0ace-5365-864a61df1103.htm
---
# Autodesk.Revit.DB.Family.GetFamilySymbolIds Method

**中文**: 族

Gets the ids of the FamilySymbols owned by this Family.

## Syntax (C#)
```csharp
public ISet<ElementId> GetFamilySymbolIds()
```

## Returns
The ids of the FamilySymbols.